# language:ru

Функционал: Поиск на авито

  Структура сценария:  Найдем самые дорогие принтеры на авито
    Пусть открыт ресурс авито
    И в выпадающем списке категорий выбрана  <категория>
    И в поле поиска введено значение <товар>
    Тогда кликнуть по выпадающему списку региона
    Тогда в поле регион введено значение <город>
    И нажата кнопка показать объявления
    Тогда открылась страница результаты по запросу <товар>
    И активирован чекбокс только с доставкой
    И в выпадающем списке сортировки выбрано значение <сортировка>
    И в консоль выведено значение названия и цены <количество> первых товаров
    Примеры:
      | категория         | товар   | город       | сортировка | количество |
      | Оргтехника        | принтер | Владивосток | Дороже     | 3          |
      | Автомобили        | kia     | Оренбург    | Дороже     | 5          |
      | ЗапчастиАксесуары | колесо  | Самара      | Дешевле    | 1          |

